---
kind: property
id: P:Autodesk.Revit.DB.SlabShapeEditor.SlabShapeVertices
source: html/01fbf5d9-6fa7-6483-6a1c-5cf439f27dc7.htm
---
# Autodesk.Revit.DB.SlabShapeEditor.SlabShapeVertices Property

All of the vertices that can be edited.

## Syntax (C#)
```csharp
public SlabShapeVertexArray SlabShapeVertices { get; }
```